## 베이스 라인(러프해도 됨)
# na 날리기
#   -데이터 불러오고
#   -시각화
#   -전처리/후처리
#   -선형00 이용해서 회귀/분류
#   -결과 8
# 비교할 땐 대상이 있어야 함(특히 회귀). 내가 만든 코드랑. 
## -개선합시다! 시즌1
#     - 결정트리(디시젼트리) : 전처리/후처리 안함. 중요한건 해석이지 결과가 아님
#     - 결과 해석이 쉬움 : 해석을 할 수 있는 여지 남김 <= 8
# 선형00보다 알고리즘이 좋고 결과 해석이 쉬움
## -개선합시다! 시즌2
#     - 랜덤 포레스트
#     - XGBoost : 중간과정 해석이 힘듦 < 8
# 빨리 결과를 내고 해석을 해서 얘기를 해야함 fast and run

# 박해선 번역 책
# 디시전트리는 데이터에 민감하다. 조금만 데이터가 변경되면 결과가 많이 바뀜
# 데이터가 민감하니까 나무를 많이 심음. 랜덤 포레스트가 보완가능
# 랜덤 포레스트 기반 데이터 프로젝트
# 회귀보다 분류를 많이 씀
